---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostWrongCategory
source: html/13ee532d-9ac5-8c03-0cbb-3fe576a22edc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostWrongCategory Property

Rebar can't be placed in a family of category [Name].

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRebarHostWrongCategory { get; }
```